//==============================================================================
// Effect 設定ファイル
//------------------------------------------------------------------------------
// アイテムやスキルの効果をカスタマイズするためのファイルです。
//==============================================================================
/// <reference path="./MysteryRogueSystem.d.ts" />
const MR = require("MysteryRogueSystem/ts/main");

MR.db.effects = {
    //--------------------------------------------------------------------------
    "kEffect_すばやさ草A": Effect({
        parameterBuffs: [
            ParameterBuffEffect({
                parameterKey: "agi",    // すばやさの、
                type: "constant",       // 定数バフを、
                level: +1,              // 1レベル分上昇させる。
                turn: 10,               // ターン数は10。
            }),
        ],
        flavorEffect: FlavorEffect({
            animationId: 12,            // 効果発動時に ID:12 のアニメーションを再生する。
        }),
    }),
};

